{
  "description": {
    "default": "The function now known as the Riemann zeta function was first defined by Euler for integers greater than 1 as an infinite series:\nζ(s) = 1 + 1/(2^s) + 1/(3^s) + ...\nThe definition was later extended to real numbers by Chebyshev, and to the complex plane by Riemann. However, as it diverged on all s with a real component less than or equal to 1, a special version of the function had to be defined in order to preserve the continuity of its derivatives. This is known as an analytic continuation, and the zeta function's analytic continuation relates to this infamous meme:\n1 + 2 + 3 + 4 + ... = -1/12 = ζ(-1)\n\nIn this theory, we will be examining the zeta function on the line perpendicular to the x-axis at x = 0.5, known as the critical line. In 1859, it was hypothesised by Riemann himself that, other than the so-called 'trivial zeroes' lying at negative even integers -2, -4, -6, ..., every other root of the function lies on this critical line.",
    "zh-Hans": "黎曼 ζ 函数最早由欧拉提出，在大于 1 的整数上定义为以下无穷级数：\nζ(s) = 1 + 1/(2^s) + 1/(3^s) + ...\n后来，这个定义被切比雪夫拓展到实数上，再被黎曼拓展到复数上。然而，由于它在所有实部不超过 1 的 s 上发散，函数必须被重新定义，以在拓展定义域的同时保持各阶导数连续。这被称之为解析延拓。黎曼函数的解析延拓还衍生出了一个著名的梗：\n1 + 2 + 3 + 4 + ... = -1/12 = ζ(-1)\n\n在这个理论中，我们将研究黎曼 ζ 函数在 x = 0.5 处垂直于 x 轴的直线上的行为，这条线又被称为临界线。1859 年，黎曼本人猜想，除了位于负偶数 -2、-4、-6、... 处的“平凡零点”之外，黎曼 ζ 函数的其它零点都位于这条临界线上。",
    "zh-Hant": "黎曼 ζ 函數由歐拉首次提出，其原始定義是於 s 為任何大於 1 的整數時的無窮級數：\nζ(s) = 1 + 1/(2^s) + 1/(3^s) + ...\n這個原始定義在後來先由切比雪夫擴展到實數，再被黎曼擴展到複數。然而，由於它在實部小於等於 1 的所有複數 s 上皆發散，為了保證該函數處處連續，數學家定義了另一個行為相同且定義域更廣的ζ函數。這被稱為解析延拓。這也造成了一個著名的迷因:\n1 + 2 + 3 + 4 + ... = -1/12 = ζ(-1)\n\n在這個理論中，我們將探索在 x = 0.5 處垂直於 x 軸的直線（稱為臨界線）上 zeta 函數的行為。 1859 年，黎曼臆測：除了位於負偶數 -2、-4、-6、... 處的所謂“平凡零點”之外，ζ 函數的所有其他根都位於這條臨界線上。",
    "de": "Die heute als Riemannsche Zeta-Funktion bekannte Funktion wurde erstmals von Euler für ganze Zahlen größer als 1 als unendliche Reihe definiert: \nζ(s) = 1 + 1/(2^s) + 1/(3^s) + ... \nDie Definition wurde später von Tschebyschow auf reelle Zahlen und von Riemann auf die komplexe Zahlenebene erweitert. Allerdings, da sie für alle s, deren Realteil kleiner oder gleich 1 ist, divergierte, musste eine spezielle Variante der Funktion definiert werden, um die Stetigkeit ihrer Ableitungen zu erhalten. Dies ist bekannt als eine analytische Fortsetzung, und die analytische Fortsetzung der Zeta-Funktion bezieht sich auf dieses berüchtigte Meme: \n1 + 2 + 3 + 4 + ... = -1/12 = ζ(-1)\nIn dieser Theorie werden wir die Zeta-Funktion auf der Geraden senkrecht zur x-Achse bei x = 0.5 untersuchen, die als kritische Gerade bekannt ist. Im Jahr 1859 wurde von Riemann selbst die Hypothese aufgestellt, dass, abgesehen von den sogenannten \"trivialen Nullstellen\", die bei negativen geraden ganzen Zahlen liegen: -2, -4, -6, ..., jede andere Nullstelle der Funktion auf dieser kritischen Geraden liegt.",
    "es": "Esta función conocida como la función de Riemann Zeta fue definida por Euler para los números enteros mayores a 1 como una serie de infinitos:\nζ(s) = 1 + 1/(2^s) + 1/(3^s) + ...\nSu definición fue extendida a los números reales gracias a Chebyshev, y luego al plano complejo gracias a Riemann. Sin embargo, a medida que diverge para todo s con un componente real menor o igual a 1, una versión especial de la función fue definida para preservar la continuidad de sus valores derivados. Esta se le conoce como la continuación analítica, y la misma función analítica de la función zeta está relacionada a su infame meme:\n1 + 2 + 3 + 4 + ... = -1/12 = ζ(-1)\n\nEn esta teoría, examinaremos la función de zeta en la línea perpendicular al eje X cuando x = 0.5, conocido como la ruta crítica. En 1859, fue hipotetizado por el mismo Riemann que, excluyendo a los conocidos \"ceros triviales\" que permanecen con negativos pares integros -2, -4, -6, ... cada otra raíz de la función yace en esta ruta crítica.",
    "fr": "Cette fonction, aujourd'hui connue sous le nom de fonction zêta de Riemann, a d'abord été définie par Euler pour les entiers supérieurs à 1 comme une série infinie :\nζ(s) = 1 + 1/(2^s) + 1/(3^s) + ...\nCette définition a été ensuite étendue aux nombres réels par Tchebychev, et au plan complexe par Riemann. Cependant, comme elle divergeait pour tout s avec une partie réelle inférieure ou égale à 1, une version spéciale de la fonction a dû être définie afin de préserver la continuité de ses dérivées. Ceci est appelé prolongement analytique, et le prolongement analytique de la fonction zêta est lié à cet infâme mème :\n1 + 2 + 3 + 4 + ... = -1/12 = ζ(-1)\n\nDans cette théorie, nous examinerons la fonction zêta sur la droite perpendiculaire à l'axe des x à x=0,5, appelée droite critique. En 1859, Riemann lui-même a émis l'hypothèse que, à part les « zéros triviaux » situés aux entiers négatifs pairs -2, -4, -6, ..., toutes les autres racines de la fonction sont situées sur la droite critique.",
    "ru": "Функция, известная сейчас как дзета-функция Римана, была впервые определена Эйлером для целых чисел больше 1, как бесконечный ряд: \nζ(s) = 1 + 1/(2^s) + 1/(3^s) + ... \nПозднее определение было расширено Чебышевым на вещественные числа и Риманом на комплексную плоскость. Однако, поскольку ряд расходился при всех значениях s с вещественной частью меньше или равной 1, пришлось определить специальную версию функции, чтобы сохранить непрерывность её производных. Это называется аналитическим продолжением, и аналитическое продолжение дзета-функции связано с этим (печально) известным мемом: \n1 + 2 + 3 + 4 + ... = -1/12 = ζ(-1)\n\nВ данной теории мы будем рассматривать дзета-функцию на прямой, перпендикулярной оси x при x = 0.5, известной как критическая прямая. В 1859 году сам Риман предположил, что, за исключением так называемых \"\"тривиальных нулей\"\", расположенных в отрицательных чётных целых числах -2, -4, -6, ..., все остальные корни функции лежат на этой критической прямой.",
    "uk": "Функція, наразі відома як дзета-функція Рімана, вперше була визначена Ейлером для цілих чисел, більших за 1, як нескінчений ряд: \nζ(s) = 1 + 1/(2^s) + 1/(3^s) + ...\nЗгодом Чебишов розширив її визначення на дійсні числа, а Ріман — на всю комплексну площину. Однак, оскільки ряд розбіжний при всіх s з дійсною частиною меншою або рівною 1, потрібно було визначити особливе розширення функції, яке б зберегло неперервність її похідних. Це розширення відомо як аналітичне продовження, і аналітичне продовження дзети-функції пов'язане з цим відомим мемом:\n1 + 2 + 3 + 4 + ... = -1/12 = ζ(-1)",
    "vi": "Trước khi được mang tên Riemann, hàm zeta được định nghĩa bởi Euler dưới dạng chuỗi vô hạn trên miền các số tự nhiên lớn hơn 1:\nζ(s) = 1 + 1/(2^s) + 1/(3^s) + ...\nĐịnh nghĩa hàm zeta được mở rộng tới các số thực bởi Chebyshev, và sau đó đến số phức bởi Riemann. Tuy nhiên, do chuỗi này phân kì đối với các giá trị s với phần thực nhỏ hơn hoặc bằng 1, một \"phiên bản\" khác của hàm zeta được định nghĩa để các đạo hàm của zeta được liên thông trên toàn mặt phẳng số phức. Đây được gọi là thác triển giải tích, và thác triển giải tích của hàm zeta có mối liên hệ đến một meme nổi tiếng:\n1 + 2 + 3 + 4 + ... = -1/12 = ζ(-1)\n\nTrong lí thuyết này, chúng ta sẽ khám phá hàm zeta trên đường thẳng x = 0.5, gọi là đường tới hạn. Vào năm 1859, Riemann đã giả thuyết rằng, ngoài những \"không điểm tầm thường\" nằm trên các số âm chẵn -2, -4, -6, ..., tất cả các nghiệm của hàm đều nằm trên đường tới hạn này."
  }
}